s = input().split()
w = int(s[0])
if w > 1000 :                       #重量超过1000克
    if not (w-1000) % 500 :            #如果超出部分为500克的整数倍，则其判断条件为：将超出部分对500求余，其值为0
        m = 8 + 4*(w-1000)/500           #对费用计算：基本费用+4*整数倍
#        print(int(m))
    elif (w - 1000) % 500 :            #如果超出部分为不为500的整数倍，则其判断条件为：将其超出部分对500求余，其余数不为零
        m = 8 + 4*((w-1000)//500 + 1)         #费用计算：基本收费+4*（对超出部分求商，获得的500的整数倍+1）
#       print(int(m))
else :                    #重量不超出1000克，只收取基本费
    m = 8
#判断是否加急
if "y" in s :
    m+=5
    print(int(m))
elif "n"in s :
    print(int(m))
